trtxash/STM32/old/2024/STM32F407xE/HAL/00_FreeRTOS_Template/Hardware/Inc/oled.h
#ifndef __OLED_H
#define __OLED_H

#include "stm32f4xx.h"
#include "sys.h"
#include "delay.h"

//-----------------测试LED端口定义----------------

// #define LED_ON       HAL_GPIO_WritePin(GPIOC,GPIO_PIN_13, GPIO_PIN_RESET)
// #define LED_OFF      HAL_GPIO_WritePin(GPIOC,GPIO_PIN_13, GPIO_PIN_SET)

//-----------------OLED端口定义----------------
#define OLED_GPIO_SCL_ENABLE() __HAL_RCC_GPIOB_CLK_ENABLE()
#define OLED_GPIO_SCL_DISABLE() __HAL_RCC_GPIOB_CLK_DISABLE()
#define OLED_GPIO_SDA_ENABLE() __HAL_RCC_GPIOB_CLK_ENABLE()
#define OLED_GPIO_SDA_DISABLE() __HAL_RCC_GPIOB_CLK_DISABLE()

#define OLED_GPIO_SCL_Port GPIOB
#define OLED_GPIO_SCL_Pin GPIO_PIN_5
#define OLED_GPIO_SDA_Port GPIOB
#define OLED_GPIO_SDA_Pin GPIO_PIN_4

#define OLED_SCL_Clr() HAL_GPIO_WritePin(OLED_GPIO_SCL_Port, OLED_GPIO_SCL_Pin, GPIO_PIN_RESET) // SCL
#define OLED_SCL_Set() HAL_GPIO_WritePin(OLED_GPIO_SCL_Port, OLED_GPIO_SCL_Pin, GPIO_PIN_SET)

#define OLED_SDA_Clr() HAL_GPIO_WritePin(OLED_GPIO_SDA_Port, OLED_GPIO_SDA_Pin, GPIO_PIN_RESET) // SDA
#define OLED_SDA_Set() HAL_GPIO_WritePin(OLED_GPIO_SDA_Port, OLED_GPIO_SDA_Pin, GPIO_PIN_SET)

#define OLED_RES_Clr() HAL_GPIO_WritePin(GPIOD, GPIO_PIN_2, GPIO_PIN_RESET) // RES
#define OLED_RES_Set() HAL_GPIO_WritePin(GPIOD, GPIO_PIN_2, GPIO_PIN_SET)

#define OLED_CMD 0  //写命令
#define OLED_DATA 1 //写数据

void OLED_ClearPoint(u8 x, u8 y);
void OLED_ColorTurn(u8 i);
void OLED_DisplayTurn(u8 i);
void I2C_Start(void);
void I2C_Stop(void);
void I2C_WaitAck(void);
void Send_Byte(u8 dat);
void OLED_WR_Byte(u8 dat, u8 mode);
void OLED_DisPlay_On(void);
void OLED_DisPlay_Off(void);
void OLED_Refresh(void);
void OLED_Clear(void);
void OLED_DrawPoint(u8 x, u8 y, u8 t);
void OLED_DrawLine(u8 x1, u8 y1, u8 x2, u8 y2, u8 mode);
void OLED_DrawCircle(u8 x, u8 y, u8 r);
void OLED_ShowChar(u8 x, u8 y, u8 chr, u8 size1, u8 mode);
void OLED_ShowChar6x8(u8 x, u8 y, u8 chr, u8 mode);
void OLED_ShowString(u8 x, u8 y, u8 *chr, u8 size1, u8 mode);
void OLED_ShowNum(u8 x, u8 y, u32 num, u8 len, u8 size1, u8 mode);
void OLED_ShowChinese(u8 x, u8 y, u8 num, u8 size1, u8 mode);
void OLED_ScrollDisplay(u8 num, u8 space, u8 mode);
void OLED_ShowPicture(u8 x, u8 y, u8 sizex, u8 sizey, u8 BMP[], u8 mode);
void OLED_Init(void);
void OLED_DisplayInit(void);
void OLED_Display(void);

#endif
